cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "broot"
brew "cmake"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dive"
brew "elixir"
brew "erlang"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "git-delta"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gpg"
brew "heroku"
brew "hivemind"
brew "htop"
brew "icu4c"
brew "imagemagick"
brew "jemalloc"
brew "jq"
brew "kafkacat"
brew "mas"
brew "mysql@5.7", restart_service: true, link: true
brew "nginx", restart_service: true
brew "node-build"
brew "nodenv"
brew "openssl"
brew "pgcli"
brew "pinentry-mac" # yubikey
brew "pipenv"
brew "postgres", restart_service: true
brew "pstree"
brew "pyenv"
brew "rbenv-default-gems"
brew "rbenv"
brew "readline"
brew "redis", restart_service: true
brew "rustup"
brew "shellcheck"
brew "stow"
brew "terraform"
brew "terraform@0.11"
brew "vim"
brew "watchman"
brew "wget"
brew "xz"
brew "yarn"
brew "ykman" # yubikey
brew "yubikey-personalization" # yubikey
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "authy"
cask "caption"
cask "caption"
cask "docker"
cask "dropbox"
cask "dropshare"
cask "encryptme"
cask "fantastical"
cask "firefox-developer-edition"
cask "firefox"
cask "google-chrome-canary"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "homebrew/cask-drivers/yubico-yubikey-manager"
cask "homebrew/cask-drivers/yubico-yubikey-personalization-gui"
cask "homebrew/cask-drivers/yubico-yubikey-piv-manager"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "hookshot"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "little-snitch"
cask "muzzle"
cask "obsidian"
cask "openjdk"
cask "oversight"
cask "signal"
cask "skype"
cask "slack"
cask "soulseek"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "DaisyDisk", id: 411643860
mas "Gifski", id: 1351639930
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 409201541
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
