cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"
brew "asdf"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "cmake"
brew "coreutils"
brew "cosign" # sign and verify build artefacts
brew "curl"
brew "direnv"
brew "dive"
brew "exa"
brew "fd"
brew "findutils"
brew "fzy"
brew "gh"
brew "git-delta"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gpg"
brew "hopenpgp-tools"
brew "htop"
brew "icu4c"
brew "jemalloc"
brew "jq"
brew "mariadb" # sigstore
brew "mas"
brew "opensc" # sigstore
brew "openssh"
brew "openssl"
brew "orbstack" # docker
brew "pinentry-mac" # yubikey
brew "pstree"
brew "readline"
brew "shellcheck"
brew "softhsm" # sigstore
brew "starship"
brew "swig" # yubikey
brew "terraform"
brew "vim"
brew "wget"
brew "xz"
brew "ykman" # yubikey
brew "yubico-piv-tool" # yubikey
brew "yubikey-personalization" # yubikey
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh"

cask "1password-cli"
cask "1password"
cask "appcleaner"
cask "audacity"
cask "authy"
cask "cameracontroller"
cask "caption"
cask "dropbox"
cask "dropshare"
cask "fantastical"
cask "firefox"
cask "gifski"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "homebrew/cask-drivers/yubico-yubikey-manager"
cask "homebrew/cask-drivers/yubico-yubikey-personalization-gui"
cask "homebrew/cask-drivers/yubico-yubikey-piv-manager"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "hookshot"
cask "iterm2"
cask "kap"
cask "ledger-live"
cask "little-snitch"
cask "maccy"
cask "modern-csv"
cask "muzzle"
cask "obsidian"
cask "oversight"
cask "postico"
cask "proxyman"
cask "raycast"
cask "shottr"
cask "slack"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "temurin" # Java JDK
cask "the-unarchiver"
cask "todoist"
cask "transmission"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zoom"
cask "zsa-wally"
