cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "mas-cli/tap", pin: true
tap "heroku/brew"

brew "mas"
brew "zsh"
brew "git"
brew "gnu-sed"
brew "stow"
brew "yarn"
brew "ack"
brew "openssl"
brew "coreutils"
brew "hub"
brew "findutils"
brew "vim"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "nodenv"
brew "node-build"
brew "gpg"
brew "direnv"
brew "pyenv"
brew "readline"
brew "xz"
brew "pgcli"
brew "watchman"
brew "bash"
brew "gnupg"
brew "yubikey-personalization" # yubikey
brew "ykman" # yubikey
brew "pinentry-mac" # yubikey
brew "rbenv"
brew "rbenv-default-gems"
brew "redis", restart_service: true
brew "postgres", restart_service: true
brew "curl"
brew "heroku"
brew "go"
brew "wget"
brew "jemalloc"
brew "icu4c"
brew "automake"
brew "cmake"
brew "jq"
brew "docker", link: false
brew "docker-machine", link: false
brew "mysql@5.7", restart_service: true
brew "nginx", restart_service: true
brew "exa"
brew "fd"
brew "hub"
brew "shellcheck"
brew "hivemind"
brew "kafkacat"
brew "pipenv"
brew "awscli"
brew "imagemagick"

cask "1password"
# cask "1password-cli"
cask "google-chrome"
cask "notion"
cask "docker"
cask "adoptopenjdk8"
cask "spotify"
cask "zoomus"
cask "graphiql"
cask "pretzel"
cask "skype"
cask "keepingyouawake"
cask "appcleaner"
cask "the-unarchiver"
cask "transmission"
cask "vlc"
cask "firefox"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "iterm2"
cask "imageoptim"
cask "visual-studio-code"
cask "beamer"
cask "soulseek"
cask "keybase"
cask "little-snitch"
cask "mullvadvpn"
cask "shrinkit"
cask "google-drive-file-stream"
cask "homebrew/cask-versions/google-chrome-canary"
cask "rekordbox"
cask "caption"
cask "tor-browser"
cask "oversight"
cask "slack"
cask "figma"
cask "sketch"
cask "authy"
cask "tableplus"
cask "caption"
cask "mpv"
cask "max"
cask "shrinkit"
cask "dropshare"
cask "karabiner-elements"
cask "signal"
cask "gpg-suite"
cask "homebrew/cask-drivers/yubico-yubikey-manager"
cask "homebrew/cask-drivers/yubico-yubikey-personalization-gui"
cask "homebrew/cask-drivers/yubico-yubikey-piv-manager"
cask "sensiblesidebuttons"

mas "com.apple.dt.Xcode", id: 497799835
mas "com.matthewleon.FLACTunes", id: 517984121
mas "com.iconfactory.mac.xScope", id: 889428659
mas "Copy-em-Paste", id: 876540291
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.apple.iMovieApp", id: 408981434
mas "com.acqualia.soulver", id: 413965349
