cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/versions"

brew "mas"
brew "zsh"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "stow"
brew "yarn", args: ["without-node"]
brew "ack"
brew "openssl"
brew "coreutils"
brew "hub"
brew "findutils"
brew "vim", args: ["with-custom-ruby"]
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "nodenv"
brew "node-build"
brew "gpg"
brew "direnv"
brew "pyenv"
brew "readline"
brew "xz"
brew "pgcli"
brew "watchman"
brew "bash"
brew "gnupg"
brew "yubikey-personalization" # yubikey
brew "ykman" # yubikey
brew "pinentry-mac" # yubikey
brew "rbenv"
brew "postgres"
brew "curl", args: ["with-openssl"]
brew "heroku"
brew "go"

mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
mas "FLACTunes FLAC Converter", id: 517984121
mas "xScope", id: 889428659
mas "Copy'em Paste", id: 876540291
mas "Paprika Recipe Manager", id: 451907568
mas "Pocket", id: 568494494
mas "Keynote", id: 409183694
mas "Soulver", id: 413965349
mas "Todoist", id: 585829637

cask "the-unarchiver"
cask "quip"
cask "1password"
cask "google-chrome"
cask "transmission"
cask "vlc"
cask "firefox"
cask "caskroom/versions/firefox-developer-edition"
cask "iterm2"
cask "imageoptim"
cask "visual-studio-code"
cask "beamer"
cask "soulseek"
cask "keybase"
cask "little-snitch"
cask "mullvad"
cask "shrinkit"
cask "google-drive-file-stream"
cask "caskroom/versions/google-chrome-canary"
cask "rekordbox"
cask "caption"
cask "torbrowser"
cask "steam"
cask "onyx"
cask "oversight"
cask "spotify"
cask "slack"
cask "virtualbox"
cask "figma"
cask "kap"
cask "insomnia"
cask "sketch"
cask "authy"
cask "tableplus"
cask "caption"
cask "mpv"
cask "lepton"
cask "max"
cask "shrinkit"
cask "dropshare"
cask "charles"
cask "github"
cask "karabiner-elements"
cask "signal"
cask "gpg-suite"
cask "homebrew/cask-drivers/yubico-yubikey-manager"
cask "homebrew/cask-drivers/yubico-yubikey-personalization-gui"
cask "homebrew/cask-drivers/yubico-yubikey-piv-manager"
cask "discord"
cask "homebrew/cask-drivers/sonos"
cask "sensiblesidebuttons"
