cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/versions"

brew "mas"
brew "zsh"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "stow"
brew "yarn", args: ["without-node"]
brew "ack"
brew "openssl"
brew "coreutils"
brew "hub"
brew "findutils"
brew "vim"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "nodenv"
brew "node-build"
brew "gpg"
brew "direnv"
brew "pyenv"
brew "readline"
brew "xz"
brew "pgcli"

mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
mas "FLACTunes FLAC Converter", id: 517984121
mas "xScope", id: 889428659
mas "Copy'em Paste", id: 876540291
mas "Paprika Recipe Manager", id: 451907568
mas "Pocket", id: 568494494

cask "the-unarchiver"
cask "quip"
cask "1password"
cask "google-chrome"
cask "transmission"
cask "vlc"
cask "firefox"
cask "caskroom/versions/firefox-developer-edition"
cask "skype"
cask "iterm2"
cask "imageoptim"
cask "visual-studio-code"
cask "beamer"
cask "soulseek"
cask "keybase"
cask "little-snitch"
cask "mullvad"
cask "shrinkit"
cask "google-drive-file-stream"
cask "caskroom/versions/google-chrome-canary"
cask "rekordbox"
cask "caption"
cask "torbrowser"
cask "steam"
cask "onyx"
cask "oversight"
cask "spotify"
cask "slack"
cask "react-native-debugger"
cask "macpass"
cask "virtualbox"
cask "fontbase"
cask "figma"
cask "notion"
#cask "audacity"
cask "kap"
cask "insomnia"
cask "sketch"
cask "authy"
cask "tableplus"
cask "caption"
cask "mpv"
cask "lepton"
#cask "send-to-kindle"
cask "handbrake"
cask "max"
cask "shrinkit"
cask "expo-xde"
cask "dropshare"
cask "android-studio"
cask "genymotion"
cask "charles"
cask "github"
