cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/versions"

mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
mas "FLACTunes FLAC Converter", id: 517984121
mas "xScope", id: 889428659
mas "Copy'em Paste", id: 876540291
mas "Paprika Recipe Manager", id: 451907568
mas "Pocket", id: 568494494

brew "zsh"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "stow"
brew "yarn", args: ["without-node"]
brew "ack"
brew "openssl"
brew "coreutils"
brew "hub"
brew "findutils"
brew "vim"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "nodenv"
brew "node-build"
brew "gpg"
brew "python3"

cask "the-unarchiver"
cask "quip"
cask "1password"
cask "google-chrome"
cask "transmission"
cask "vlc"
cask "firefox"
cask "firefoxnightly"
cask "firefoxdeveloperedition"
cask "skype"
cask "iterm2"
cask "imageoptim"
cask "visual-studio-code"
cask "beamer"
cask "soulseek"
cask "keybase"
cask "little-snitch"
cask "mullvad"
cask "shrinkit"
cask "google-backup-and-sync"
cask "google-chrome-canary"
cask "rekordbox"
cask "caption"
cask "torbrowser"
cask "anki"
cask "steam"
cask "charles"
cask "fontexplorer-x-pro"
cask "onyx"
cask "oversight"
cask "blockblock"
